Revit 2027 API
ParameterMap.ForwardIterator Method
Retrieve a forward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ParameterMapIterator ForwardIterator()
Public Overridable Function ForwardIterator As ParameterMapIterator
public:
virtual ParameterMapIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ParameterMapIterator
override ForwardIterator : unit -> ParameterMapIterator
Return Value
ParameterMapIterator
Returns a forward moving iterator to the map.
See Also
Reference
ParameterMap Class
Autodesk.Revit.DB Namespace